> LGTM, but I'll let infra approve...
> What are we using if we're removing this env variable w/o a replacement?

I thought I explained this in the description, but we're replacing this with a SSM parameter set in Terraform (the same process we use for secrets). The plus side of this is that that change can be toggled at the infra level *without* requiring redeploy of the application -- we can just restart the app and it will pick up the new setting. If you look at the infrasec PR I linked up there, you can see it in the Terraform plans here:

```text
  # module.app.aws_ssm_parameter.storage_backend will be created
  + resource "aws_ssm_parameter" "storage_backend" {
      + arn         = (known after apply)
      + description = "Storage backend for application"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/app-staging/storage_backend"
      + tier        = "Standard"
      + type        = "String"
      + value       = (sensitive value)
      + version     = (known after apply)
    }
```

So that environment variable will still be set, it will just be set somewhere else.